[
    {
        "id": 1,
        "language": "Python",
        "questions": {
            "How do you define a function in Python?": "def",
            "How do you create a list in Python?": "[]",
            "How do you comment a single line in Python?": "#",
            "How do you convert an integer to a string in Python?": "str()",
            "How do you convert a variable to an integer in Python?": "int()",
            "How do you check the length of a list in Python?": "len()",
            "How do you append an element to a list in Python?": ".append()",
            "How do you iterate over items in a list(called list) in Python?": "for item in list:",
            "How do you remove an element from a list in Python?": ".remove()",
            "How do you join elements of a list into a string in Python?": ".join()"
        }
    },
    {
    "id": 2,
    "language": "HTML/CSS",
    "questions": {
    "How do you create an unordered list in HTML?": "<ul>",
    "What CSS property is used to change the text color?": "color",
    "What HTML tag is used to define a paragraph?": "<p>",
    "How do you italicize text in HTML?": "<i>",
    "How do you create an ordered list in HTML?": "<ol>",
    "What CSS property is used to change the background color?": "background-color",
    "What HTML tag is used to create a hyperlink?": "<a>",
    "How do you align text to the center in CSS?": "text-align: center;",
    "What HTML tag is used to insert an image?": "<img>",
    "What CSS Property is used to adjust the margin between elements": "margin"
        }
    },
    {
    "id": 3,
    "language": "JavaScript",
    "questions": {
    "Which event occurs when a user clicks on an HTML element?": "onClick",
    "How do you call a function named 'myFunction' in JavaScript?": "myFunction()",
    "How do you write a message in an alert box?": "alert()",
    "Which operator is used for concatenation in JavaScript?": "+",
    "What is the result of 10 + '5' in JavaScript?": "105",
    "How do you check the length of a list in JavaScript?": ".length",
    "How do you access the first element of an array in JavaScript?": "array[0]",
    "How do you define a function in JavaScript?": "function",
    "How do you check the data type of a variable in JavaScript?": "typeof",
    "Which operator is used to check strict equality in JavaScript?": "==="
        }
    }
]